# Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.
import math

c = -1
while (c):
    a = [float(i) for i in input("Введите координаты точки Х через запятую: ").split(',')]
    b = [float(i) for i in input("Введите координаты точки Y через запятую: ").split(',')]
    if (len(a) == len (b) == 2):
        
        print(f"Расстояние между Х и У = {math.sqrt((math.pow((b[0] - a[0]),2) + math.pow((b[1] - a[1]),2)))//1 + math.sqrt((math.pow((b[0] - a[0]),2) + math.pow((b[1] - a[1]),2)))*100%100//1/100}")
        c = 0
    else:
        print ("Введите две координаты")
        с = -1
